**free 

Ctl-Opt Main(REPO3);

Dcl-Proc REPO3;

    //Envia mensaje de bienvenida..............................
    snd-msg ' Hola saludos a [IBMi] desde Visual Studio Code ';

End-Proc;